---
type: FamilyPointPlacementReference
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyPointPlacementReference

`Autodesk.Revit.DB.FamilyPointPlacementReference` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Location | — | `public Transform Location { get ; }` |
| Property | Name | — | `public string Name { get ; }` |
| Property | PointReference | — | `public Reference PointReference { get ; }` |